In [8]:
import pandas
import pandas as pd
df=pd.read_csv(r"E:\Santhosh\Pandas_assign8\friends.txt")
df

           friends@quality
0   Hari   @Arrogant
1  Harsha @Irritating
2      Vamsi  @Intelligent
3          Varun  @Anxious

In [4]:
df=pd.read_csv(r"E:\Santhosh\Pandas_assign9\familymemberrelation.txt")
df

         Member*Relation
0     MV.Brahmmam*Father
1      Ratnakumar*Mother
2  Sravanthi*Eldersister
3  Sravani*Youngersister

In [9]:
df=pd.read_csv(r"E:\Santhosh\Pandas_assign9\VegfoodTaste.txt")
df

      Vegfood|Taste
0      Panner|Spicy
1      Mushroom|Hot
2  Vegbiryani|Salty
3  Aloosamosa|sweet

In [11]:
import pandas
import pandas as pd
df=pd.read_csv(r"E:\Santhosh\Pandas_assign9\NonvegTaste.txt")
df

              Nonveg|Taste
0  Chikenbiryani|verytasty
1       muttonbiryani|good
2      prawns|satisfactory
3             crabs|good

In [10]:
import pandas
import pandas as pd
df=pd.read_csv(r"E:\Santhosh\Pandas_assign9\NonvegTaste.txt",sep="|")
df

          Nonveg         Taste
0  Chikenbiryani     verytasty
1  muttonbiryani          good
2         prawns  satisfactory
3          crabs        good

In [15]:
df=pd.read_csv(r"E:\Santhosh\Pandas_assign9\monthsandseason.txt")
df

     january&winter
0    febuary&winter
1      march&winter
2      april&summer
3        may&summer
4       june&summer
5        july&rainy
6      august&rainy
7   september&rainy
8     october&rainy
9   november&winter
10  december&winter

In [2]:
import pandas
import pandas as pd
df=pd.read_excel(r"E:\Santhosh\Pandas_assign9\freindsquality.xlsx")
df

    friends    Qualities
0      Hari     Arrogant
1    Harsha   Irritating
2     Vamsi  Intelligent
3     Varun      Anxiety
4    Parvin          Don
5   Shabana     Innocent
6  Jayasree    Developer
7    Anusha         Good
8    Reshma        Funny

In [22]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [23]:
df.shape

(9, 2)

In [32]:
df.head(n=2)

  friends   Qualities
0    Hari    Arrogant
1  Harsha  Irritating

In [33]:
df.tail(n=4)

    friends  Qualities
5   Shabana   Innocent
6  Jayasree  Developer
7    Anusha       Good
8    Reshma      Funny

In [29]:
df.columns

Index(['friends', 'Qualities'], dtype='object')

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   friends    9 non-null      object
 1   Qualities  9 non-null      object
dtypes: object(2)
memory usage: 272.0+ bytes

In [40]:
df.iloc[0:6,0:1]

   friends
0     Hari
1   Harsha
2    Vamsi
3    Varun
4   Parvin
5  Shabana

In [3]:
df=pd.read_excel(r"E:\Santhosh\Pandas_assign9\New XLSX Worksheet.xlsx")
df

   alphabets  Numbers
0         A       1.0
1         B       2.0
2          C      3.0
3          D      4.0
4         E       5.0
5          F      6.0
6          G      7.0
7         H       8.0
8          I      9.0
9          J      NaN
10         K     11.0
11        L      12.0
12         M     13.0
13         N     14.0
14         O     15.0
15        P      16.0
16         Q     17.0

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   alphabets  17 non-null     object
 1   Numbers    16 non-null     float64
dtypes: float64(1), object(1)
memory usage: 400.0+ bytes

In [7]:
df.head(n=8)

  alphabets  Numbers
0        A       1.0
1        B       2.0
2         C      3.0
3         D      4.0
4        E       5.0
5         F      6.0
6         G      7.0
7        H       8.0

In [9]:
df.tail(n=9)

   alphabets  Numbers
8          I      9.0
9          J      NaN
10         K     11.0
11        L      12.0
12         M     13.0
13         N     14.0
14         O     15.0
15        P      16.0
16         Q     17.0

In [10]:
df.shape

(17, 2)

In [11]:
df.index

RangeIndex(start=0, stop=17, step=1)

In [17]:
df.iloc[0:6,0:1]

  alphabets
0        A
1        B
2         C
3         D
4        E
5         F